app/controllers/homes_controller.rb

  def index
  	@sum_sale = Sale.select("sum(sales.item_price*purchase_count) as vlr_compra ").first.vlr_compra
---
SELECT sum(sales.item_price*purchase_count) as vlr_compra FROM "sales" LIMIT 1

  def import

	 	unless params[:file].blank? then
			parseado = CSV.parse( File.open('import', 'r') { |f| params[:file].read }.force_encoding("UTF-8"), col_sep: "\t" )
			#head = parseado.first.map{|x| x.gsub(" ", "_")}
			parseado.delete_at(0) # delete first row
			parseado.each do |c|
				Sale.create(
				:purchaser_name=>c[0],
				:item_description=>c[1],
				:item_price=>c[2],
				:purchase_count=>c[3],
				:merchant_address=>c[4],
				:merchant_name=>c[5]
				)
---
INSERT INTO "sales" ("created_at", "item_description", "item_price", "merchant_address", "merchant_name", "purchase_count", "purchaser_name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)